<template>
  <div class="terms flex w-full flex-col gap-2">
    <header class="main-container text-2xl font-bold flex items-center justify-center">
      ПОЛИТИКА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ <br />
      ООО «СТАЖЕР.ОНЛАЙН» от «18» марта 2025 года
    </header>
    <div class="main-container">
      <div v-for="section in policySections" :key="section.title">
        <h2 class="text-xl font-bold mb-2 mt-4">{{ section.title }}</h2>
        <div v-html="section.content.replace(/\n/g, '<br>')" class="whitespace-pre-line"></div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const policySections = [
  {
    title: '1. ОБЩИЕ ПОЛОЖЕНИЯ',
    content: `1.1. Настоящая Политика обработки персональных данных (далее - Политика) действует в отношении всех персональных данных, которые обрабатываются на сайте: https://stazher.online/ (далее – «Веб-сайт»).

1.2. ООО «Стажер.Онлайн» (далее – «Оператор») (ИНН 7743458820, КПП 774301001) разработало и утвердило настоящую Политику. Политика является дополнением к «Пользовательскому соглашению». Все, что прямо не урегулировано настоящей Политикой, должно регулироваться в соответствии с Пользовательским соглашением.

1.3. Настоящая Политика:
• разработана в целях реализации требований действующего законодательства Российской Федерации в области обработки и защиты персональных данных;
• раскрывает способы и принципы обработки Оператором персональных данных, права и обязанности Оператора при обработке персональных данных, права субъектов персональных данных, а также включает объем персональных данных, обрабатываемых Оператором.

1.4. Настоящая Политика действует в отношении всей информации, которую Оператор может получить в результате автоматизированной обработки персональных данных через Веб-сайт, с помощью электронных писем или иным образом.

1.5. «Пользователь сайта» — субъект персональных данных, являющийся посетителем Веб-сайта Оператора (далее – «Субъект персональных данных», «Пользователь»).

1.6. «Персональные данные» - любая информация, прямо или косвенно относящаяся к определенному или определяемому физическому лицу - Пользователю;

1.7. «Обработчик» – юридическое лицо, которому Оператор поручает обработку персональных данных Пользователей;

1.8. «Обработка Персональных данных» - любое действие или совокупность действий с персональным данными, совершаемых на Веб-сайте с использованием средств автоматизации или без их использования. Обработка персональных данных включает в себя следующие процессы:
• сбор;
• запись;
• систематизацию;
• накопление;
• хранение;
• уточнение;
• извлечение;
• использование;
• обезличивание;
• блокирование;
• удаление;
• передачу (предоставление доступа);
• уничтожение.

1.9. Политика не регулирует порядок обработки и защиты персональных данных в отношении любых иных сайтов или веб-объектов (включая, помимо прочего, любые мобильные приложения), доступных через Веб-сайт или на которые Веб-сайт содержит ссылку. Наличие или включение ссылки на любой такой сайт или объект на Веб-сайте не подразумевает наличие каких-либо гарантий и заверений со стороны ООО «Стажер.Онлайн».

1.10. Используя Веб-сайт, Субъект персональных данных выражает свое согласие с настоящей Политикой.

1.11. В случае несогласия Пользователя с условиями Политики использование им Веб-сайта должно быть немедленно прекращено.`
  },
  {
    title: '2. ЦЕЛИ И ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ',
    content: `2.1. Оператор в своей деятельности обеспечивает соблюдение принципов обработки персональных данных, предусмотренных в ст. 5 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных».

2.2. Оператор осуществляет сбор и дальнейшую обработку персональных данных в следующих целях:
2.2.1. осуществления предусмотренных учредительными документами видов деятельности;
2.2.2. продвижения услуг Оператора на рынке путем осуществления прямых контактов с потенциальными клиентами с помощью средств связи (допускается только при условии предварительного согласия субъекта персональных данных);
2.2.3. осуществление безопасного и продуктивного взаимодействия с заинтересованными лицами посредством сайтов в сети «Интернет»;
2.2.4. направления консультаций, ответов, обратившимся лицам с помощью средств связи и указанных ими контактных данных.
2.2.5. консультирования, преддоговорного и иного взаимодействия, предоставление информации о продуктах и сервисах Оператора, проводимых мероприятиях и событиях, проведение маркетинговых исследований, формирование рекламных предложений, направлением по сетям электросвязи, получение обратной связи по итогам взаимодействия с Оператором в указанных в разделе 2 целях.`
  },
  {
    title: '3. ОБЪЕМ ОБРАБАТЫВАЕМЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ',
    content: `3.1. Оператор может осуществлять целенаправленную обработку следующих персональных данных:
3.1.1. Ф.И.О;
3.1.2. наименования должности и места работы;
3.1.3. описание сферы профессиональной деятельности;
3.1.4. контактный адрес электронной почты;
3.1.5. контактный номер телефона;
3.1.6. сведения о профессиональных компетенциях, знаниях и навыках;
3.1.7. инн

3.2. Оператор осуществляет обработку Персональных данных Субъекта как без использования средств автоматизации, так и с их использованием, а также смешанным способом.

3.2.1. Оператор имеет право передавать Персональные данные Субъекта без его согласия:
3.2.2. Уполномоченным государственным органам, в том числе органам прокуратуры, дознания и следствия, судам, по их мотивированному запросу в порядке и случаях, установленных Законодательством;
3.2.3. В иных случаях, прямо предусмотренных Законодательством.

3.3. Субъекты персональных данных могут отказаться принимать аутентификационные файлы cookie Веб-сайта используя настройки своего Интернет-браузера. Однако это может привести к некоторым неудобствам при использовании Веб-сайта.

3.4. Передача персональных данных Пользователей третьим лицам допускается с письменного согласия Субъекта персональных данных, за исключением случаев, когда это необходимо в целях предупреждения угрозы жизни и здоровью Субъектов персональных данных и в иных случаях, установленных законодательством Российской Федерации.

3.5. Оператор обеспечивает безопасность Персональных данных в порядке, предусмотренном Законодательством, в том числе путем:
3.5.1. Применения правовых, организационных и технических мер по обеспечению безопасности Персональных данных при их Обработке в Информационных системах Персональных данных, необходимых для выполнения требований к защите Персональных данных, исполнение которых обеспечивает установленные Правительством Российской Федерации уровни защищенности Персональных данных;
3.5.2. Идентификации субъектов доступа и объектов доступа, а также обеспечения мер по их управлению, ограничения доступа к данным, определению перечня лиц из числа работников Оператора, имеющих право осуществлять обработку Персональных данных;
3.5.3. Использования сертифицированного программного обеспечения, предназначенного для автоматизированной обработки Персональных данных и защиты Информационных систем Персональных данных;
3.5.4. Защиты машинных носителей Персональных данных, среды виртуализации, технических средств, а также информационной системы, ее средств, систем связи и передачи данных;
3.5.5. Регистрации событий безопасности с возможностью просмотра и анализа информации о таких событиях и реагирования на них;
3.5.6. Применения мер антивирусной защиты;
3.5.7. Определения актуальных угроз безопасности при их Обработке в Информационных системах Персональных данных;
3.5.8. Обеспечения доступности Персональных данных;
3.5.9. Контроля за принимаемыми мерами по обеспечению безопасности Персональных данных и защищенностью Персональных данных.

3.6. Оператор прекращает Обработку Персональных данных при достижении целей Обработки, в случае истечения срока действия или отзыва Субъектом своего согласия на Обработку, а также в случае выявления неправомерной Обработки Персональных данных. Оператор имеет право продолжить Обработку Персональных данных в случаях, предусмотренных Законодательством.

3.7. Персональные данные хранятся и обрабатываются в течение срока, необходимого для достижения заявленных целей Обработки.

3.8. Персональные данные собираются, хранятся и обрабатываются на территории Российской Федерации. Трансграничная передача Персональных данных не осуществляется.`
  },
  {
    title: '4. ПРАВА И ОБЯЗАННОСТИ СТОРОН',
    content: `4.1. Субъект персональных данных имеет право на получение сведений об обработке его Персональных данных Оператором.

4.2. Субъект персональных данных вправе требовать от Оператора уточнения своих Персональных данных, их блокирования или уничтожения.

4.3. Субъект персональных данных вправе в любое время полностью или в какой-либо части отозвать ранее предоставленное Оператору согласие на обработку персональных данных. Указанные в настоящем пункте права могут быть реализованы путем направления Оператору письменного обращения.

4.4. Для реализации и защиты своих прав и законных интересов субъект персональных данных или его представители имеют право обратиться к Оператору любым удобным и возможным для них способом (в том числе по электронной почте info@stazher.online).

4.5. Обязанности Субъекта персональных данных:
4.5.1. Субъект Персональных данных обязан предоставлять достоверные и актуальные персональные данные;
4.5.2. Уведомлять Оператора обо всех изменениях своих персональных данных;

4.6. Обязанности Оператора персональных данных:
4.6.1. Обеспечить защиту Персональных данных Пользователей от неправомерного использования или утраты;
4.6.2. Предоставлять Пользователю информацию, касающуюся процессов обработки его Персональных данных.
4.6.3. По требованию Пользователя уточнять обрабатываемые Персональные данные, блокировать или удалять, если персональные данные являются неполными, устаревшими, незаконно полученными или не являются необходимыми для заявленных целей обработки;
4.6.4. В случае достижения цели обработки Персональных данных незамедлительно прекратить обработку персональных данных и уничтожить соответствующие персональные данные в срок, не превышающий 30 (тридцати) календарных дней с момента достижения цели обработки персональных данных, если иное не предусмотрено законодательством Российской Федерации.
4.6.5. Оператор персональных данных обязуется предоставлять Персональные данные только по требованию уполномоченных лиц и только в той части, которая необходима им в связи с выполнением ими своих трудовых функции, в соответствии с настоящей Политикой и законодательством Российской Федерации.

4.7. Оператор Оператор вправе передавать персональные данные Пользователя с его согласия Обработчикам в целях, указанных в разделе 2 Политики. Информация об обработчике персональных данных доводится до Пользователя в момент регистрации на платформе и/или при предоставлении доступа к функционалу платформы, включая возможность взаимодействия с работодателями. В частности, адрес электронной почты Пользователя может быть доступен работодателям, зарегистрированным на платформе, для целей коммуникации и взаимодействия в рамках предоставляемых услуг.`
  },
  {
    title: '6. ИЗМЕНЕНИЕ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ',
    content: `6.1. Оператор сохраняет за собой право вносить изменения в настоящую Политику. В заголовке Политики указывается дата принятия её последней редакции.

6.2. К настоящей Политике и отношениям между Субъектом и Оператором, возникающими в связи с применением Политики, подлежит применению право Российской Федерации.

6.2. Оператор вправе вносить изменения в Политику в одностороннем порядке. Новая редакция Политики вступает в силу с момента её опубликования Оператором на сайте: https://stazher.online/policy.`
  },
  {
    title: '7. КОНТАКТНАЯ ИНФОРМАЦИЯ',
    content: `7.1. Реквизиты и контактные данные Оператора.
ООО «Стажер.Онлайн»:
ОГРН: 1247700684373
ИНН: 7743458820
КПП: 774301001
Юридический адрес: 125581, город Москва, Флотская ул, д. 13 к. 2, кв. 304.
Электронная почта: info@stazher.online

7.2. Переписка между вами и ООО «Стажер.Онлайн» может поддерживаться по электронной почте, путем отправления почтовых отправлений, либо через службы доставки. Электронная почта и другая корреспонденция, отправленная с указанного выше адреса, является официальной.`
  }
]
</script>

<style scoped lang="scss">
.terms {
  padding: 20px;
  background-color: #f1f0f3;
  min-height: 100vh;

  header {
    color: $primary-color;
  }
}
</style>
