<template>
  <div class="terms flex w-full flex-col gap-2">
    <header class="main-container text-2xl font-bold flex items-center justify-center text-center">
      СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ
      <br />
      ООО «СТАЖЕР.ОНЛАЙН»
    </header>
    <div class="main-container">
      <div class="whitespace-pre-line">
        <p class="mb-4">
          Настоящим, Вы даете свое письменное согласие на обработку Ваших персональных данных
          Обществу с Ограниченной Ответственностью ООО «Стажер.Онлайн» (ООО «Стажер.Онлайн», 125581,
          город Москва, Флотская ул, д. 13 к. 2, кв. 304.), в том числе:
        </p>

        <ul class="list-disc pl-6 mb-4">
          <li>Ф.И.О;</li>
          <li>Наименования должности и места работы;</li>
          <li>Описание сферы профессиональной деятельности;</li>
          <li>Контактный адрес электронной почты;</li>
          <li>Контактный номер телефона;</li>
          <li>Сведения о профессиональных компетенциях, знаниях и навыках;</li>
          <li>ИНН;</li>
        </ul>

        <p class="mb-4">
          Обработка персональных данных может осуществляться с использованием средств автоматизации
          или без таковых, а также путем смешанной обработки персональных данных, включая сбор,
          запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),
          извлечение, использование, обезличивание, блокирование, удаление, уничтожение персональных
          данных, в том числе в информационных системах ООО «Стажер.Онлайн», и совершение иных
          действий, предусмотренных Федеральным законом от 27.07.2006 № 152-ФЗ «О персональных
          данных».
        </p>

        <p class="mb-4">Цели обработки Ваших персональных данных:</p>

        <ul class="list-disc pl-6 mb-4">
          <li>
            продвижения услуг на рынке путем осуществления прямых контактов с потенциальными
            клиентами с помощью средств связи (допускается только при условии предварительного
            согласия субъекта персональных данных);
          </li>
          <li>
            осуществление безопасного и продуктивного взаимодействия с заинтересованными лицами
            посредством сайтов в сети «Интернет»;
          </li>
          <li>
            направления консультаций, ответов, обратившимся лицам с помощью средств связи и
            указанных ими контактных данных;
          </li>
          <li>
            консультирование, преддоговорное и иное взаимодействие, предоставление информации о
            продуктах и сервисах Оператора, проводимых мероприятиях и событиях, проведение
            маркетинговых исследований, формирование рекламных предложений.
          </li>
        </ul>

        <p class="mb-4">
          Согласие на обработку персональных данных начинает действовать со дня его подписания и
          действует в течение неопределенного срока.
        </p>

        <p>
          Согласие на обработку персональных данных может быть отозвано Пользователем в любой
          момент, путем направления письма на электронный адрес: info@stazher.online (тема письма:
          «Отзыв согласия на обработку персональных данных»).
        </p>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped lang="scss">
.terms {
  padding: 20px;
  background-color: #f1f0f3;
  min-height: 100vh;

  header {
    color: $primary-color;
  }

  ul {
    margin-bottom: 1rem;
  }

  li {
    margin-bottom: 0.5rem;
  }
}
</style>
